[
    {
        "id": "1",
        "date": "February 2014",
        "name": "Placer Travel Board",
        "description": "A social media site where users can share photos and information about little-known amazing locations they come across or would like to visit. Locations can also be set by GPS coordinates.",
        "contributions": "Incorporated Pinterest-style layout for locations on landing page, created model in Django backend to save and retrieve info for comments and fixed frontend to display info (name of user leaving comment, time and day comment is left, number of comments total left for  each location), created ability for users to star locations and view only starred locations, created page to display location details.",
        "imageUrl": "img/PlacerTravel.jpg",
        "codeUrl": "https://github.com/breanajones/TravelApp/commits/master",
        "technologies": ["Python", "Django", "PostgreSQL", "JavaScript", "HTML", "CSS", "Git", "Bootstrap", "AngularJS"]
    },

    {
        "id": "2",
        "date": "January 2014",
        "name": "Green Wholesale Delivery Service",
        "description": "A web-based address book that uses MongoDB to allow users to store, update and retrieve customer and product information to place orders for a delivery service. Jade was used as the markup language in place of HTML.",
        "contributions": "Added fields to contact model using MongoDB to retrieve and display information on contact page and add contact page, created pre-populated dropdown menu with states for address selection and ability to save address selection, added button with ability to delete customers, created edit customer page with ability to edit, made customer list searchable by zip code, last name, and company.",
        "imageUrl": "img/GreenWholesale.jpeg",
        "codeUrl": "https://github.com/breanajones/CustomerDeliveryApp/commits/master",
        "technologies": ["MongoDB", "Node.js", "Jade", "Javascript", "CSS", "Git", "Bootstrap", "AngularJS", "Heroku"]
    },

    {
        "id": "3",
        "date": "February - March 2014",
        "name": "Clearview",
        "description": "A live client project where I was able to debug, perform QA and assist with hotfixes as part of an internship during the final three weeks of class at Coding Campus.",
        "contributions": "Added a notes field in the company profile model (using Django framework) and created notes section in the front end which could retrieve, update and delete information from the backend, fixed design of table to fill in accidental blank space and hid delete button on page, changed links in company section.",
        "imageUrl": "img/Clearview2.jpeg",
        "technologies": ["Python", "Django", "Git", "HTML", "AngularJS"]
    },
    {
        "id": "4",
        "date": "March 2014 - Currently",
        "name": "Mozilla l10n es-MX (Firefox for Android)",
        "description": "As the project lead for localization of Firefox for Android into Mexican Spanish, I am responsible to ensure it is up to date and ready to launch with every release cycle, every 6 weeks.",
        "contributions": "I spearheaded market research to determine what browsers Mexican users would prefer for the new version of Firefox for Android (Fennec). I created the survey that received well over 100 responses from Mexican Firefox Android users, compiled the results, and made the determination for what browsers to include. I am working with team members/volunteers and coordinate with Mozilla localization employees to ensure all tasks are completed on schedule. As a result of my involvement, I was invited to attend a Mozilla es-MX localization boot camp in Mexico City, courtesy of Mozilla.",
        "imageUrl": "img/FennecProject.jpeg",
        "infoUrl": "https://reps.mozilla.org/u/breanagonzales/",
        "technologies": ["Localization", "Android"],
        "projectQuote": "As a result, one new mozillian, Breana Jones, has really taken initiative. Last night she attended an IRC meetup with Mozilla Mexico, she’s added herself to the es-MX team wiki page, and has announced that she will coordinate the l10n efforts for Firefox for Android to ensure that it is launched in the multilocale builds with Firefox 30.",
        "quoteLink": "https://blog.mozilla.org/l10n-sig/"
    },
    {
        "id": "5",
        "date": "February 2014",
        "name": "Love Note App",
        "description": "Love Note is an app my team and I created at Startup Weekend Provo, which helps bring couples closer together by remembering the little things. Users answer a prompted question every so often so that Love Note can learn the way they love to be loved. Love Prompts are then sent via the LoveNote app to their significant other to provide them ideas for the best ways to show love often for their partner.",
        "contributions": "Customized and helped design landing page explaining the product, downloaded and incorporated Google font, set up DNS records and pointed server to the new registered domain, performed testing for live site.",
        "imageUrl": "img/LoveNote.png",
        "codeUrl": "https://github.com/sos12/Love-Note/commits/master",
        "infoUrl": "http://lovenoteapp.co",
        "videoUrl": "https://www.youtube.com/watch?v=bQkIhJDd9fE",
        "technologies": ["Node.js", "HTML", "CSS", "Git", "Bootstrap"]
    }
]
